In [1]:
import pandas as pd

### Example 1 : Employee Tenure

In [2]:
data = {'employee_id': [1, 2, 3], 'hire_date': ['2015-01-01', '2018-06-15', '2020-09-30']}
df = pd.DataFrame(data)
df['hire_date'] = pd.to_datetime(df['hire_date'])

In [3]:
df

   employee_id  hire_date
0            1 2015-01-01
1            2 2018-06-15
2            3 2020-09-30

In [4]:
current_date = pd.to_datetime('2023-07-19')
df['tenure_years'] = (current_date - df['hire_date']).dt.days // 365

In [5]:
df

   employee_id  hire_date  tenure_years
0            1 2015-01-01             8
1            2 2018-06-15             5
2            3 2020-09-30             2

### Example 2 : Social Media Engagement

In [6]:
data = {'post_id': [1, 2, 3], 'likes': [100, 150, 200], 'comments': [20, 25, 30], 'shares': [10, 15, 20]}
df = pd.DataFrame(data)

In [7]:
df

   post_id  likes  comments  shares
0        1    100        20      10
1        2    150        25      15
2        3    200        30      20

In [8]:
df['engagement_rate'] = (df['likes'] + df['comments'] + df['shares']) / 3

In [9]:
df

   post_id  likes  comments  shares  engagement_rate
0        1    100        20      10        43.333333
1        2    150        25      15        63.333333
2        3    200        30      20        83.333333

### Example 3: Sales Data

In [10]:
data = {'product_id': [1, 2, 3], 'units_sold': [100, 150, 200], 'price_per_unit': [10, 15, 20]}
df = pd.DataFrame(data)

In [11]:
df

   product_id  units_sold  price_per_unit
0           1         100              10
1           2         150              15
2           3         200              20

In [12]:
df['revenue'] = df['units_sold'] * df['price_per_unit']

In [13]:
df

   product_id  units_sold  price_per_unit  revenue
0           1         100              10     1000
1           2         150              15     2250
2           3         200              20     4000

### Example 4 : House Data

In [14]:
data = {
    'house_id': [1, 2, 3],
    'living_room_sqft': [300, 400, 350],
    'kitchen_sqft': [150, 200, 180],
    'bedroom_sqft': [500, 600, 550],
    'bathroom_sqft': [100, 150, 130]
}
df = pd.DataFrame(data)
df

   house_id  living_room_sqft  kitchen_sqft  bedroom_sqft  bathroom_sqft
0         1               300           150           500            100
1         2               400           200           600            150
2         3               350           180           550            130

In [15]:
df['total_sqft'] = df['living_room_sqft'] + df['kitchen_sqft'] + df['bedroom_sqft'] + df['bathroom_sqft']

In [16]:
df

,house_id,living_room_sqft,kitchen_sqft,bedroom_sqft,bathroom_sqft,total_sqft
0,1,300,150,500,100,1050
1,2,400,200,600,150,1350
2,3,350,180,550,130,1210